#include <stdio.h>

void main()
{
	// 자료형

	// 이 코드는 오늘해야되는 실습과제입니다.
	// 자료형 <- 데이터룰 저장하기 위해 데이터의 종류를 알려주는 것입니다.
	// 문자, 정수, 실수
	// char <- 한 문자만 저장할 수 있는 자료형입니다.   
	//int <- 정수를 저장할 수 있는 자료형입니다.
	//float <- 실수를 저장할 수 있는 자료형입니다.

	// 대입 연산자

	// int [box(100)] <- 100;
	// 변수 =100
	// 대입 연산자 "="는 오른쪽에 있는 피연산자의 값을
	// 왼쪽에 있는 피연산자에게 저장하는 연산자입니다.

	// 전체 주석

	
	char alphabet = "A";
	int box = 100;
	float pi = 3.14;

	// 문자열로 지정한 100입니다
	printf("100\n");
	printf("%d\n", alphabet);
	printf("%d\n", pi);
	// box라는 변수의 저장되어 있는 값을 출력하는 100입니다.
	

    printf("%d\n", box);
	printf("안녕하세요!? 김대환입니다.");
	
	


}